# Задача 1

integral_number = int (input("Введите целое число "))
print ("Введено число " + str (integral_number))

string_var = input("Введите строковые данные ")
print("Введены данные " + string_var)

float_var = float (input("Введите любое число "))
print("Было введено число " + str(float_var))

print("Значения всех переменных -" + str(integral_number) + " ; " + string_var + " ; " + str (float_var))

